app/controllers/api/v1/alternative_titles_controller.rb

  def index
    @alternative_titles = AlternativeTitle.find(:all, include: [:language])
---
SELECT "languages".* FROM "languages" WHERE "languages"."id" = $1 LIMIT 1  [["id", 1]]