app/controllers/api/v1/approvals_controller.rb

  def mark
    respond_to do |format|
      type = params[:type]
      mark = params[:mark]
      if ["admin", "moderator"].include?(current_api_user.user_type)
---
SELECT "users".* FROM "users" WHERE "users"."user_type" = 'admin' LIMIT 1

                original_record.approved = true
                if original_record.update_attributes(approved_values)
                  if approved_record.user_id
                    user = User.find approved_record.user_id
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 11]]

        else
          id = params[:approved_id]
          if type == "MovieMetadata"
            record = MovieMetadata.find id
---
SELECT "movie_metadata".* FROM "movie_metadata" WHERE "movie_metadata"."id" = $1 LIMIT 1  [["id", "1"]]