app/controllers/api/v1/crews_controller.rb

  def index
    @crews = Crew.find(:all, include: [:person, :movie])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT 1  [["id", 31]]