app/controllers/api/v1/follows_controller.rb

  def index
    #TODO remove next line
    current_user = User.first
    @follows = current_user.follows.all
---
SELECT "users".* FROM "users" LIMIT 1
SELECT "follows".* FROM "follows" WHERE "follows"."user_id" = 11

  def show
    #TODO remove next line
    current_user = User.first
    @follow = current_user.follows.find params[:id]
---
SELECT "users".* FROM "users" LIMIT 1
SELECT "follows".* FROM "follows" WHERE "follows"."user_id" = 11 AND "follows"."id" = $1 LIMIT 1  [["id", "2"]]

  def update
    respond_to do |format|
      #TODO remove next line
      current_user = User.first
      follow = current_user.follows.find params[:id]
      if follow.update_attributes(params[:follow])
---
SELECT "users".* FROM "users" LIMIT 1
SELECT "follows".* FROM "follows" WHERE "follows"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "follows" SET "followable_type" = 'Movie', "updated_at" = '2013-08-09 10:30:21.777866' WHERE "follows"."id" = 1

  def destroy
    respond_to do |format|
      #TODO remove next line
      current_user = User.first
      follow = current_user.follows.find params[:id]
      if follow.destroy
---
SELECT "users".* FROM "users" LIMIT 1
SELECT "follows".* FROM "follows" WHERE "follows"."user_id" = 11 AND "follows"."id" = $1 LIMIT 1  [["id", "1"]]
DELETE FROM "follows" WHERE "follows"."id" = $1  [["id", 1]]

  def filter
    #TODO remove next line
    current_user = User.find 11
    @follows = current_user.follows.where(followable_type: params[:filter]).all
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 11]]
SELECT "follows".* FROM "follows" WHERE "follows"."user_id" = 11 AND "follows"."followable_type" = 'Movie'