app/controllers/api/v1/genres_controller.rb

  def index
    begin
      @genres = @cache.get "genres"
---
SELECT "genres".* FROM "genres"