app/controllers/api/v1/images_controller.rb

SELECT "images".* FROM "images" LIMIT 1
---
  def index
    @images = Image.where(approved: true).includes(:taggable)
    movie_ids = []
    @images.each do |image|

SELECT "users".* FROM "users" LIMIT 1
SELECT "images".* FROM "images" WHERE "images"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def show
    begin
      @image = @cache.get "images/#{params[:id]}"
      @media_tags = @cache.get "images/#{params[:id]}/media_tags"
      @media_keywords = @cache.get "images/#{params[:id]}/media_keywords"
    rescue
      if current_api_user && ["admin", "moderator"].include?(current_api_user.user_type)
        @image = Image.where(id: params[:id])

SELECT "images".* FROM "images" WHERE "images"."id" = $1 LIMIT 1  [["id", "2"]]
INSERT INTO "images" ("approved", "created_at", "image_file", "image_type", "imageable_id", "imageable_type", "is_main_image", "title", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
UPDATE "images" SET "title" = 'update image', "updated_at" = '2013-08-09 16:42:02.926360' WHERE "images"."id" = 2
---
  def find_related_by_image_id(image_id)
    image = Image.find image_id
    keyword_ids = image.media_keywords.map(&:keyword_id)
    related_images = []
    media_keywords = MediaKeyword.all
    media_keywords.each do |mk|
      if keyword_ids.include?(mk.keyword_id) && mk.mediable_id != image.id && mk.mediable_type == "Image" && mk.mediable.approved == true
        related_images.push mk.mediable