app/controllers/api/v1/images_controller.rb

SELECT "users".* FROM "users" LIMIT 1
---
  def create
    @image = Image.new params["image"]
    if current_api_user && ["admin", "moderator"].include?(current_api_user.user_type)