app/controllers/api/v1/lists_controller.rb

  def index
    page = params[:page] ? params[:page] : 1
    begin
      cached_content = @cache.get "lists?page=#{page}"
      if cached_content
        @lists = cached_content
      end
    rescue
      if current_api_user && ["admin", "moderator"].include?(current_api_user.user_type)
        @lists = List.where("list_type = '' OR list_type IS NULL").includes(:list_items, :user)
---
SELECT "lists".* FROM "lists" LIMIT 1
SELECT "users".* FROM "users" LIMIT 1
SELECT "list_items".* FROM "list_items" WHERE "list_items"."list_id" = 1
SELECT "lists".* FROM "lists" WHERE "lists"."user_id" = 11

  def show
    begin
      @list = @cache.get "list/#{params[:id]}"
      @movies = @cache.get "list/#{params[:id]}/movies"
      @people = @cache.get "list/#{params[:id]}/people"
      @images = @cache.get "list/#{params[:id]}/images"
      @videos = @cache.get "list/#{params[:id]}/videos"
      @keywords = @cache.get "list/#{params[:id]}/keywords"
      @tags =  @cache.get "list/#{params[:id]}/tags"
    rescue
      if current_api_user && ["admin", "moderator"].include?(current_api_user.user_type)
        @list = List.where(id: params[:id]).includes(:list_items, :user, :follows)
---
SELECT "users".* FROM "users" LIMIT 1
SELECT "lists".* FROM "lists" WHERE "lists"."user_id" = 11 AND "lists"."id" = $1 LIMIT 1  [["id", "9"]]
SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1

  def update
    respond_to do |format|
      list = current_api_user.lists.find params[:id]
      if list.update_attributes(params[:list])
---
SELECT "lists".* FROM "lists" WHERE "lists"."user_id" = 11 AND "lists"."id" = $1 LIMIT 1  [["id", "9"]]
UPDATE "lists" SET "title" = 'updated title', "description" = 'updated description', "updated_at" = '2013-08-09 10:51:22.428952' WHERE "lists"."id" = 15

  def destroy
    respond_to do |format|
      if ["admin", "moderator"].include?(current_api_user.user_type)
        list = List.find(params[:id])
      else
        list = current_api_user.lists.find params[:id]
      end
      if list.destroy
---
SELECT "users".* FROM "users" LIMIT 1
SELECT "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT 1  [["id", "3"]]
SELECT "lists".* FROM "lists" WHERE "lists"."user_id" = 11 AND "lists"."id" = $1 LIMIT 1  [["id", "9"]]
DELETE FROM "lists" WHERE "lists"."id" = $1  [["id", 3]]