app/controllers/api/v1/list_items_controller.rb

  def create
    respond_to do |format|
      #TODO remove next line
      current_user = User.first
      list = current_user.lists.find params[:list_item][:list_id]
      if list.list_items.create(params[:list_item])
---
SELECT "users".* FROM "users" LIMIT 1
SELECT "lists".* FROM "lists" WHERE "lists"."user_id" = 11 AND "lists"."id" = $1 LIMIT 1  [["id", "2"]]
INSERT INTO "list_items" ("approved", "created_at", "list_id", "listable_id", "listable_type", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["approved", nil], ["created_at", Thu, 08 Aug 2013 16:27:22 UTC +00:00], ["list_id", 2], ["listable_id", 20], ["listable_type", "Movie"], ["updated_at", Thu, 08 Aug 2013 16:27:22 UTC +00:00]]

  def update
    respond_to do |format|
      #TODO remove next line
      current_user = User.first
      list = current_user.lists.find params[:list_item][:list_id]
      list_item = list.list_items.find params[:id]
      if list_item.update_attributes(params[:list_item])
---
SELECT "users".* FROM "users" LIMIT 1
SELECT "list_items".* FROM "list_items" WHERE "list_items"."list_id" = 2 AND "list_items"."id" = $1 LIMIT 1  [["id", "3"]]
SELECT "lists".* FROM "lists" WHERE "lists"."user_id" = 11 AND "lists"."id" = $1 LIMIT 1  [["id", "2"]]
UPDATE "list_items" SET "listable_type" = 'Video', "updated_at" = '2013-08-08 17:26:58.768908' WHERE "list_items"."id" = 3

  def destroy
    respond_to do |format|
      #TODO remove next line
      current_user = User.first
      list = current_user.lists.find params[:list_item][:list_id]
      list_item = list.list_items.find params[:id]
      if list_item.destroy
---
SELECT "users".* FROM "users" LIMIT 1
SELECT "list_items".* FROM "list_items" WHERE "list_items"."list_id" = 2 AND "list_items"."id" = $1 LIMIT 1  [["id", "3"]]
SELECT "lists".* FROM "lists" WHERE "lists"."user_id" = 11 AND "lists"."id" = $1 LIMIT 1  [["id", "2"]]
DELETE FROM "list_items" WHERE "list_items"."id" = $1  [["id", 2]]