app/controllers/api/v1/locks_controller.rb

SELECT "users".* FROM "users" WHERE "users"."user_type" = 'admin' LIMIT 1
---
  def mark
    respond_to do |format|
      id = params[:id]
      type = params[:type]
      field = params[:field]
      if current_api_user.user_type == "admin" && ["Movie", "Person"].include?(type)

SELECT "users".* FROM "users" WHERE "users"."user_type" = 'admin' LIMIT 1
---
  def unmark
    respond_to do |format|
      id = params[:id]
      type = params[:type]
      field = params[:field]
      if current_api_user.user_type == "admin" && ["Movie", "Person"].include?(type)