app/controllers/api/v1/movies_controller.rb

SELECT "movies".* FROM "movies" INNER JOIN "alternative_titles" ON "alternative_titles"."movie_id" = "movies"."id" INNER JOIN "casts" ON "casts"."movie_id" = "movies"."id" INNER JOIN "crews" ON "crews"."movie_id" = "movies"."id" INNER JOIN "videos" ON "videos"."videable_id" = "movies"."id" AND "videos"."videable_type" = 'Movie' INNER JOIN "images" ON "images"."imageable_id" = "movies"."id" AND "images"."imageable_type" = 'Movie' INNER JOIN "movie_genres" ON "movie_genres"."movie_id" = "movies"."id" INNER JOIN "movie_keywords" ON "movie_keywords"."movie_id" = "movies"."id" INNER JOIN "movie_languages" ON "movie_languages"."movie_id" = "movies"."id" INNER JOIN "movie_metadata" ON "movie_metadata"."movie_id" = "movies"."id" INNER JOIN "revenue_countries" ON "revenue_countries"."movie_id" = "movies"."id" INNER JOIN "tags" ON "tags"."taggable_id" = "movies"."id" AND "tags"."taggable_type" = 'Movie' INNER JOIN "follows" ON "follows"."followable_id" = "movies"."id" AND "follows"."followable_type" = 'Movie' INNER JOIN "views" ON "views"."viewable_id" = "movies"."id" AND "views"."viewable_type" = 'Movie' LIMIT 1
---
  def index
    if current_api_user && ["admin", "moderator"].include?(current_api_user.user_type) && params[:moderate]
      all_items = Movie.find_all_includes