app/controllers/api/v1/movie_genres_controller.rb

  def index
    @movie_genres = MovieGenre.find(:all, include: [:genre])
---
SELECT "genres".* FROM "genres" WHERE "genres"."id" = $1 LIMIT 1  [["id", 1]]