app/controllers/api/v1/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE (alternative_titles.approved = TRUE)
SELECT "users".* FROM "users" LIMIT 1
SELECT DISTINCT "movies".id FROM "movies" LEFT OUTER JOIN "alternative_titles" ON "alternative_titles"."movie_id" = "movies"."id" WHERE (alternative_titles.approved = TRUE) LIMIT 1
SELECT "movies".* FROM "movies" WHERE "movies"."approved" = 't' LIMIT 1
---
  def index
    page = params[:page] ? params[:page] : 1
    begin
      cached_content = @cache.get "movies?page=#{page}"
      if cached_content
        @movies = cached_content
      end
    rescue
      if current_api_user && ["admin", "moderator"].include?(current_api_user.user_type) && params[:moderate]
        all_items = Movie.find_all_includes(page)
        @items_count = all_items.count
        @movies = all_items
        @all = true
      else
        all_items = Movie.find_all_approved_includes(page)

SELECT "movies".* FROM "movies"
SELECT "users".* FROM "users" LIMIT 1
SELECT "movies".* FROM "movies" WHERE "movies"."approved" = 't' AND "movies"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "alternative_titles".* FROM "alternative_titles" WHERE "alternative_titles"."movie_id" = 1
SELECT "casts".* FROM "casts" WHERE "casts"."movie_id" = 1
SELECT "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT 1  [["id", 3]]
SELECT "countries".* FROM "countries" WHERE "countries"."id" = 2 LIMIT 1
---
  def show
    begin
      cached_content = @cache.get "movie/#{params[:id]}"
      @movie = cached_content
      add_default_cached(@movie)
      load_additional_cached(@movie, "show")
    rescue
      if current_api_user && ["admin", "moderator"].include?(current_api_user.user_type) && params[:moderate]
        @movie = Movie.find_and_include_by_id(params[:id])
        @movie = @movie.first
        @original_movie = @movie
        @all = true
      else
        movies = Movie.find_and_include_all_approved
        @movie = movies.find(params[:id], :include => [:alternative_titles, :casts, :crews, :movie_genres, :movie_keywords, :revenue_countries, :production_companies, :releases, :images, :videos, :views, :follows, :tags, :movie_languages, :movie_metadatas])

INSERT INTO "alternative_titles" ("alternative_title", "approved", "created_at", "language_id", "movie_id", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
INSERT INTO "movies" ("approved", "content_score", "created_at", "locked", "original_id", "overview", "tagline", "title", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def load_additional_values(items, action)
    person_ids = []
    language_ids =[]
    genre_ids = []
    keyword_ids = []
    country_ids = []
    company_ids = []
    if action == "show"
      items = [items]
    end
    items.reject! { |c| c.nil? }
    items.each do |m|
      person_ids << @casts.map(&:person_id) if @casts
      person_ids << @crews.map(&:person_id) if @crews
      person_ids << @tags.map(&:person_id) if @tags
      language_ids << @alternative_titles.map(&:language_id) if @alternative_titles
      language_ids << @movie_languages.map(&:language_id) if @movie_languages

SELECT "statuses".* FROM "statuses" WHERE "statuses"."movie_id" = 1
---
    @keywords = keyword_ids.count > 0 ? Keyword.find_all_by_id(keyword_ids) : []
    @countries = country_ids.count > 0 ? Country.find_all_by_id(country_ids) : []
    @companies = company_ids.count > 0 ? Company.find_all_by_id(company_ids) : []
    @statuses = Status.all