app/controllers/api/v1/people_controller.rb

  def index
    if current_api_user && ["admin", "moderator"].include?(current_api_user.user_type) && params[:moderate]
      @people = Person.all
      @all = true
    else
      if current_api_user
        @people = Person.where("(approved = TRUE) OR (approved = FALSE AND user_id = ?)", current_api_user.id)
      else
        @people = Person.where(approved: true)
      end
      @all = false
    end

    @people = @people.order("people.approved DESC, people.updated_at DESC").includes(:alternative_names, :casts, :crews, :images, :videos, :views, :follows, :person_social_apps, :tags)
---
SELECT "users".* FROM "users" LIMIT 1
SELECT "alternative_names".* FROM "alternative_names" WHERE "alternative_names"."person_id" = 1
SELECT "casts".* FROM "casts" WHERE "casts"."person_id" = 1
SELECT "crews".* FROM "crews" WHERE "crews"."person_id" = 1
SELECT "people".* FROM "people" WHERE "people"."approved" = 't' LIMIT 1

  def show
    if current_api_user && ["admin", "moderator"].include?(current_api_user.user_type) && params[:moderate]
      @people = Person.find(:all, :includes => [:alternative_names, :casts, :crews, :images, :videos, :views, :follows, :person_social_apps, :tags])
---
SELECT "users".* FROM "users" LIMIT 1
SELECT "alternative_names".* FROM "alternative_names" WHERE "alternative_names"."person_id" = 1
SELECT "casts".* FROM "casts" WHERE "casts"."person_id" = 1
SELECT "crews".* FROM "crews" WHERE "crews"."person_id" = 1
SELECT "images".* FROM "images" WHERE "images"."id" = $1 LIMIT 1  [["id", 1]]