app/controllers/api/v1/tags_controller.rb

  def index
    @tags = Tag.find(:all, include: [:taggable, :person])
    @movies = Movie.find_all_by_id @tags.map(&:taggable_id)
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT 1  [["id", 1]]

  def show
    @tag = Tag.find(params[:id])
    @movies = Movie.find_all_by_id @tag.taggable_id
---
SELECT "tags".* FROM "tags" WHERE "tags"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT 1  [["id", 1]]