app/controllers/api/v1/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "2"]]
SELECT "users".* FROM "users" WHERE "users"."active" = 't' AND "users"."id" = $1 LIMIT 1  [["id", "20"]]
---
  def show
    if params[:moderate] && params[:moderate] == "true"
      @user = User.find(params[:id])
    else
      @user = User.where(active: 1).find(params[:id])

UPDATE "users" SET "active" = NULL, "updated_at" = '2013-08-12 14:35:43.681205' WHERE "users"."id" = 11
---
  def toggle_active
    respond_to do |format|
      current_api_user.active = params[:user][:toggle_active]
      if current_api_user.save