app/controllers/api/v1/users_controller.rb

  def toggle_active
    respond_to do |format|
      #TODO remove this line
      current_user = User.find params[:user_id]
---
SELECT "users".* FROM "users" LIMIT 1