app/controllers/api/v1/videos_controller.rb

  def index
    @videos = Video.where(approved: true).includes(:taggable)
    movie_ids = []
    @videos.each do |video|
---
SELECT "videos".* FROM "videos" LIMIT 1

  def show
    begin
      @video = @cache.get "videos/#{params[:id]}"
      @media_tags = @cache.get "videos/#{params[:id]}/media_tags"
      @media_keywords = @cache.get "videos/#{params[:id]}/media_keywords"
    rescue
      if current_api_user && ["admin", "moderator"].include?(current_api_user.user_type)
        @video = Video.where(id: params[:id])
---
SELECT "videos".* FROM "videos" WHERE "videos"."id" = $1 LIMIT 1  [["id", "images"]]

  def create
    @video = Video.new params["video"]
    # if current_api_user && ["admin", "moderator"].include?(current_api_user.user_type)
    #   @video.approved = true
    # end
    @video.save!
---
INSERT INTO "videos" ("approved", "created_at", "link", "link_active", "priority", "quality", "updated_at", "videable_id", "videable_type", "video_type") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"