app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies"
---
  def index
    begin
      cached_content = @cache.get "static_movies"